In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\adead\anaconda3\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\adead\anaconda3\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\adead\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\adead\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\adead\anaconda3\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\adead\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [2]:
import pandas as pd

In [3]:
df1 = pd.read_csv("C:/Users/adead/Downloads/wk8-inventory (1).csv")
df1.head()

,inventory_id,store_id,product_id,quantity_in_stock,last_restock_date,reorder_level
0,1,1,1,25,2022-10-15,10.0
1,2,1,5,42,2022-11-02,15.0
2,3,1,10,18,2022-09-30,8.0
3,4,1,15,5,2022-10-20,10.0
4,5,1,20,12,NaN,15.0

In [5]:
df2 = pd.read_csv("C:/Users/adead/Downloads/wk8-sales (1).csv")
df2.head()

,sale_id,date,store_id,customer_id,product_id,quantity,total,payment_method
0,1,2022-01-15,3.0,12,5,2,49.98,Credit Card
1,2,2022-01-16,1.0,5,10,1,49.99,credit card
2,3,2022-01-18,2.0,8,3,1,349.99,DEBIT CARD
3,4,2022-01-20,4.0,20,7,1,349.99,Cash
4,5,2022-01-22,5.0,3,15,1,1599.99,CC

In [6]:
df3 = pd.read_csv("C:/Users/adead/Downloads/wk8-stores (1).csv")
df3.head()

,store_id,store_name,address,city,state,zip_code,region,size_sqft,opening_date
0,1,City Center,123 Retail Blvd,New York,NY,10001,Northeast,32500.0,2005-05-20
1,2,Mall of Chicago,456 Shopping Ave,Chicago,IL,60611,Midwest,45000.0,2007-08-15
2,3,Los Angeles Plaza,789 Commerce St,Los Angeles,CA,90001,West,55000.0,2004-03-10
3,4,Houston Galleria,321 Main St,Houston,Texas,77002,Southwest,NaN,2008-11-05
4,5,Phoenix Outlet,654 Desert Rd,Phoenix,AZ,85001,Southwest,18500.0,2010-06-30

In [7]:
df4 = pd.read_csv("C:/Users/adead/Downloads/wk8-products (1).csv")
df4.head()

,product_id,product_name,category,subcategory,brand,price,cost,weight
0,1,Apple iPhone 13,Electronics,Smartphones,Apple,899.99,649.99,0.45
1,2,Samsung Galaxy S21,electronics,Smartphones,Samsung,799.99,539.99,0.50
2,3,Sony WH-1000XM4,ELECTRONICS,Headphones,Sony,349.99,210.00,0.60
3,4,Dell XPS 13,Electronics,Laptops,Dell,1299.99,899.99,2.80
4,5,Nike Classic Tee,Clothing,Shirts,Nike,24.99,12.50,0.20

In [9]:
df5 = pd.read_csv(r"C:\Users\adead\Downloads\wk8-customers (1).csv")
df5.head()

,customer_id,first_name,last_name,email,phone,address,city,state,zip_code,registration_date
0,1,James,Smith,james.smith@gmail.com,555-123-4567,123 Main St,New York,NY,10001,2021-03-15
1,2,Mary,Johnson,NaN,212.555.6789,456 Park Ave,New York,NY,10022,2020-11-02
2,3,John,Williams,jwilliams@yahoo.com,(555) 987-6543,789 Broadway,Los Angeles,California,90001-1234,2021-05-20
3,4,Patricia,Brown,pbrown@hotmail.com,5551234567,321 Elm St,Chicago,IL,60601,NaN
4,5,Robert,Jones,rjones23@gmail.com,555-987-3456,555 Pine St,Houston,TX,77002,2020-09-12

In [10]:
df4.describe()

       product_id        price         cost     weight
count   30.000000    30.000000    30.000000  28.000000
mean    15.500000   191.724000   203.159000   3.835714
std      8.803408   452.483576   278.924138   5.693236
min      1.000000 -1599.990000     1.800000   0.200000
25%      8.250000    46.990000    28.375000   0.500000
50%     15.500000   134.990000    82.500000   1.150000
75%     22.750000   322.490000   236.250000   3.750000
max     30.000000  1299.990000  1100.000000  25.000000

In [11]:
df2.describe()

         sale_id   store_id  customer_id  product_id   quantity        total
count  40.000000  39.000000    40.000000   40.000000  40.000000    40.000000
mean   20.500000   6.487179    14.075000   13.500000   1.625000   352.296500
std    11.690452   4.235637     8.303189    8.857852   0.952392   377.625776
min     1.000000   1.000000     1.000000    1.000000   1.000000    19.980000
25%    10.750000   3.000000     6.750000    5.750000   1.000000    99.737500
50%    20.500000   6.000000    13.500000   11.500000   1.000000   229.985000
75%    30.250000   9.500000    20.250000   21.250000   2.000000   352.487500
max    40.000000  15.000000    29.000000   30.000000   5.000000  1599.990000

In [12]:
df1.describe()

       inventory_id   store_id  product_id  quantity_in_stock  reorder_level
count     75.000000  75.000000   75.000000          75.000000      69.000000
mean      38.000000   8.000000   12.733333          22.640000      12.681159
std       21.794495   4.349588    7.179801          13.923187       3.327659
min        1.000000   1.000000    1.000000           0.000000       8.000000
25%       19.500000   4.000000    6.500000          15.000000      10.000000
50%       38.000000   8.000000   13.000000          25.000000      10.000000
75%       56.500000  12.000000   19.000000          33.500000      15.000000
max       75.000000  15.000000   25.000000          45.000000      20.000000

In [26]:
df_dict = {
    "Inventory": df1, 
    "Sales": df2, 
    "Stores": df3, 
    "Products": df4, 
    "Customers": df5
}

for name, df in df_dict.items():
    print(f"--- Missing Values in {name} ---")
    print(df.isnull().sum())
    print("\n")

--- Missing Values in Inventory ---
inventory_id         0
store_id             0
product_id           0
quantity_in_stock    0
last_restock_date    9
reorder_level        6
dtype: int64


--- Missing Values in Sales ---
sale_id           0
date              1
store_id          1
customer_id       0
product_id        0
quantity          0
total             0
payment_method    1
dtype: int64


--- Missing Values in Stores ---
store_id        0
store_name      0
address         0
city            0
state           0
zip_code        0
region          0
size_sqft       2
opening_date    1
dtype: int64


--- Missing Values in Products ---
product_id      0
product_name    0
category        0
subcategory     0
brand           0
price           0
cost            0
weight          2
dtype: int64


--- Missing Values in Customers ---
customer_id          0
first_name           0
last_name            0
email                3
phone                2
address              0
city                 0
state                0
zip_code             1
registration_date    3
dtype: int64

In [27]:
for name, df in df_dict.items():
    print(f"--- Data Types in {name} ---")
    print(df.dtypes)
    print("\n")

--- Data Types in Inventory ---
inventory_id           int64
store_id               int64
product_id             int64
quantity_in_stock      int64
last_restock_date     object
reorder_level        float64
dtype: object


--- Data Types in Sales ---
sale_id             int64
date               object
store_id          float64
customer_id         int64
product_id          int64
quantity            int64
total             float64
payment_method     object
dtype: object


--- Data Types in Stores ---
store_id          int64
store_name       object
address          object
city             object
state            object
zip_code         object
region           object
size_sqft       float64
opening_date     object
dtype: object


--- Data Types in Products ---
product_id        int64
product_name     object
category         object
subcategory      object
brand            object
price           float64
cost            float64
weight          float64
dtype: object


--- Data Types in Customers ---
customer_id           int64
first_name           object
last_name            object
email                object
phone                object
address              object
city                 object
state                object
zip_code             object
registration_date    object
dtype: object

In [28]:
unique_products = df4['product_id'].nunique()
print(f"Total unique products: {unique_products}")

Total unique products: 30

In [29]:
top_5_expensive = df4.sort_values(by='price', ascending=False).head(5)
print("Top 5 most expensive products:")
display(top_5_expensive[['product_name', 'price']])

Top 5 most expensive products:

          product_name    price
3          Dell XPS 13  1299.99
0      Apple iPhone 13   899.99
1   Samsung Galaxy S21   799.99
19    Dyson V11 Vacuum   599.99
26  Sony PlayStation 5   499.99

In [30]:
largest_store_idx = df3['size_sqft'].idxmax()
largest_store = df3.loc[largest_store_idx]
print(f"The largest store is {largest_store['store_name']} with {largest_store['size_sqft']} sqft.")

The largest store is Los Angeles Plaza with 55000.0 sqft.

In [35]:
customer_distribution = df5['state'].value_counts()
print("Customer distribution by state:")
print(customer_distribution)

Customer distribution by state:
state
TX                4
CA                3
NY                2
IL                1
California        1
AZ                1
PA                1
Texas             1
FL                1
OH                1
North Carolina    1
IN                1
Washington        1
CO                1
MA                1
Oregon            1
NV                1
MI                1
TN                1
Maryland          1
MD                1
KY                1
WI                1
NM                1
MO                1
Name: count, dtype: int64

In [37]:
df3['size_sqft'] = df3['size_sqft'].fillna(df3['size_sqft'].mean())
df1['reorder_level'] = df1['reorder_level'].fillna(df1['reorder_level'].mean())

In [38]:
df5['email'] = df5['email'].fillna(df5['email'].mode()[0])

In [39]:
df1['last_restock_date'] = df1['last_restock_date'].ffill()
df5['registration_date'] = df5['registration_date'].ffill()

In [40]:
print("Missing values in Stores:", df3['size_sqft'].isnull().sum())
print("Missing values in Inventory:", df1['reorder_level'].isnull().sum())

Missing values in Stores: 0
Missing values in Inventory: 0

In [43]:
print(f"Duplicate rows in Customers: {df5.duplicated().sum()}")
print(f"Duplicate rows in Products: {df4.duplicated().sum()}")

Duplicate rows in Customers: 0
Duplicate rows in Products: 0

In [44]:
df5 = df5.drop_duplicates(keep='first')
df4 = df4.drop_duplicates(keep='first')

In [45]:
print(f"\nNew Customers count: {len(df5)}")
print(f"New Products count: {len(df4)}")

New Customers count: 31
New Products count: 30